ms-python.python
ms-python.vscode-pylance
ms-python.black-formatter
ms-python.isort
ms-python.mypy-type-checker
ms-toolsai.jupyter
ms-toolsai.jupyter-renderers
ms-toolsai.jupyter-keymap
ms-toolsai.vscode-jupyter-cell-tags
ms-toolsai.vscode-jupyter-slideshow
golang.go
ms-azuretools.vscode-docker
graphql.vscode-graphql
esbenp.prettier-vscode
ms-vscode.makefile-tools